tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/application_motor/mc_tasks.c
    PID_SetIntegralTerm(pPIDIq[bMotor], (int32_t)0);
    PID_SetIntegralTerm(pPIDId[bMotor], (int32_t)0);

    SpdTorqCtrl_Clear(pSpeedTorqCtrl[bMotor]);

    PWMCurrFdbk_SwitchOffPWM(pPWMCurrFdbk[bMotor]);

    if (pFieldWeakening[bMotor])
    {
        FluxWkng_Clear(pFieldWeakening[bMotor]);
    }
    if (pFeedforward[bMotor])
    {
        Feedforward_Clear(pFeedforward[bMotor]);
    }
}

void FOC_UpdatePIDGains(uint8_t bMotor)
{
    SpdPosFdbkHandle_t *SpeedHandle;
    SpeedHandle = SpdTorqCtrl_GetSpeedSensor(pSpeedTorqCtrl[bMotor]);

    int16_t hM1SpeedUnit = SpdPosFdbk_GetAvrgMecSpeedUnit(SpeedHandle);

/*  The PI controller continues the PWM for few seconds after releasing the Throttle
    which can be seen when there is no load. So solve, we are updating PI parameters 
    to perevent such situation. for now only Velec. For other bikes first we should do
    the tests */
  
  
  

#if MOTOR_SELECTION == MOTOR_TSUGAWA_L13S5_350W    
    if (FOCVars[bMotor].hTeref == 0.0)
    {
        PID_SetKI(pPIDIq[bMotor], No_Load_PID_KIq_Gain);
        
    }
    else
    {
        PID_SetKI(pPIDIq[bMotor], (int16_t)LookupTable_CalcOutput(&LookupTableM1IqKi, abs(hM1SpeedUnit)));
    }
#endif  
    
    PID_SetKP(pPIDIq[bMotor], (int16_t)LookupTable_CalcOutput(&LookupTableM1IqKp, abs(hM1SpeedUnit)));
    PID_SetKI(pPIDIq[bMotor], (int16_t)LookupTable_CalcOutput(&LookupTableM1IqKi, abs(hM1SpeedUnit)));    
    PID_SetKP(pPIDId[bMotor], (int16_t)LookupTable_CalcOutput(&LookupTableM1IdKp, abs(hM1SpeedUnit)));
    PID_SetKI(pPIDId[bMotor], (int16_t)LookupTable_CalcOutput(&LookupTableM1IdKi, abs(hM1SpeedUnit)));
    
#if MOTOR_SELECTION == MOTOR_AKM_128SX_750W    
    // this PID update is for correct IqKI for imidietly stop when release trottle
    if (FOCVars[bMotor].hTeref == 0.0)
    {
        PID_SetKI(pPIDIq[bMotor], No_Load_PID_KIq_Gain);
    }
    else
    {
        PID_SetKI(pPIDIq[bMotor], (int16_t)LookupTable_CalcOutput(&LookupTableM1IqKi, abs(hM1SpeedUnit)));
    }
#endif
    
#if MOTOR_SELECTION == MOTOR_AKM_128SX_500W    
    // this PID update is for correct IqKI for imidietly stop when release trottle
    if (FOCVars[bMotor].hTeref == 0.0)
    {
        PID_SetKI(pPIDIq[bMotor], No_Load_PID_KIq_Gain);
    }
    else
    {
        PID_SetKI(pPIDIq[bMotor], (int16_t)LookupTable_CalcOutput(&LookupTableM1IqKi, abs(hM1SpeedUnit)));
    }
#endif
    
#if MOTOR_SELECTION == MOTOR_AKM_128SX_350W    
    // this PID update is for correct IqKI for imidietly stop when release trottle
    if (FOCVars[bMotor].hTeref == 0.0)
    {
        PID_SetKI(pPIDIq[bMotor], No_Load_PID_KIq_Gain);
    }
    else
    {
        PID_SetKI(pPIDIq[bMotor], (int16_t)LookupTable_CalcOutput(&LookupTableM1IqKi, abs(hM1SpeedUnit)));
    }
#endif

}

/**
 * @brief  Use this method to initialize additional methods (if any) in
 *         START_TO_RUN state
 * @param  bMotor related motor it can be M1 or M2
 * @retval none
 */
void FOC_InitAdditionalMethods(uint8_t bMotor)
{
    if (pFeedforward[bMotor])
    {
        Feedforward_InitFOCAdditionalMethods(pFeedforward[bMotor]);
    }
}

/**
 * @brief It computes the new values of Iqdref (current references on qd
 *        reference frame) based on the required electrical torque information
 *        provided by oTSC object (internally clocked).
 *        If implemented in the derived class it executes flux weakening and/or
 *        MTPA algorithm(s). It must be called with the periodicity specified
 *        in oTSC parameters
 * @param  bMotor related motor it can be M1 or M2
 * @retval none
 */
void FOC_CalcCurrRef(uint8_t bMotor)
{
    qd_t IqdTmp;

    /* update Max Power based on DC Voltage */
    pSpeedTorqCtrl[bMotor]->hBusVoltage = VbusSensor_GetAvBusVoltageVolt(pMotorPower[bMotor]->pVBS);
    MC_AdaptiveMaxPower(pSpeedTorqCtrl[bMotor]);    
    
    /* If current references iqref and idref are computed internally    */
    if (FOCVars[bMotor].bDriveInput == INTERNAL)
    {
        FOCVars[bMotor].hTeref = SpdTorqCtrl_CalcTorqueReference(pSpeedTorqCtrl[bMotor]);
        FOCVars[bMotor].Iqdref.q = SpdTorqCtrl_GetIqFromTorqueRef(pSpeedTorqCtrl[bMotor], FOCVars[bMotor].hTeref);
        FOCVars[bMotor].Iqdref.d = SpdTorqCtrl_GetIdFromTorqueRef(pSpeedTorqCtrl[bMotor], FOCVars[bMotor].hTeref);
        
        /* Use Flux Weakening to recalculate Iq and Id if it is enabled for motor */
        if (FLUX_WEAKENING_ENABLE == 1)    
        {
            IqdTmp.q = FOCVars[bMotor].Iqdref.q;
            IqdTmp.d = FOCVars[bMotor].Iqdref.d;
            FOCVars[bMotor].Iqdref = FluxWkng_CalcCurrRef(pFieldWeakening[bMotor],IqdTmp);
        }
        
        /* apply the maximum nominal limitation to the Iq */
        SpdTorqCtrl_ApplyCurrentLimitation_Iq(&FOCVars[bMotor].Iqdref, MCConfig.wNominalCurr, MCConfig.wUsrMaxCurr);
        
        if (pFeedforward[bMotor])
        {
            Feedforward_VqdffComputation(pFeedforward[bMotor], FOCVars[bMotor].Iqdref, pSpeedTorqCtrl[bMotor]);
        }
    }

    /* If current references iqref and idref are computed externaly    */
    else if (FOCVars[bMotor].bDriveInput == EXTERNAL)    //Added to calculate FlxWeakening parameters in SWD Debug mode
    {
        IqdTmp.q = FOCVars[bMotor].Iqdref.q;
        IqdTmp.d = FOCVars[bMotor].Iqdref.d;
        FOCVars[bMotor].Iqdref = FluxWkng_CalcCurrRef(pFieldWeakening[bMotor],IqdTmp);
    }
}

/**
 * @brief It set a counter intended to be used for counting the delay required
 *        for drivers boot capacitors charging of motor 1
 * @param  hTickCount number of ticks to be counted
 * @retval void
 */
void SetChargeBootCapDelayM1(uint16_t hTickCount)
{
    hBootCapDelayCounterM1 = hTickCount;
}

/**
 * @brief Use this function to know whether the time required to charge boot
 *        capacitors of motor 1 has elapsed
 * @param none
 * @retval bool true if time has elapsed, false otherwise
 */
bool ChargeBootCapDelayHasElapsedM1(void)
{
    bool retVal = false;
    if (hBootCapDelayCounterM1 == 0)
    {
        retVal = true;
    }
    return (retVal);
}

/**
 * @brief It set a counter intended to be used for counting the permanency
 *        time in STOP state of motor 1
 * @param  hTickCount number of ticks to be counted
 * @retval void
 */
void SetStopPermanencyTimeM1(uint16_t hTickCount)
{
    hStopPermanencyCounterM1 = hTickCount;
}

/**
 * @brief Use this function to know whether the permanency time in STOP state
 *        of motor 1 has elapsed
 * @param  none
 * @retval bool true if time is elapsed, false otherwise
 */
bool StopPermanencyTimeHasElapsedM1(void)
{
    bool retVal = false;
    if (hStopPermanencyCounterM1 == 0)
    {
        retVal = true;
    }
    return (retVal);
}

/**
 * @brief Executes the Motor Control duties that require a high frequency rate and a precise timing
 *
 * This is mainly the FOC current control loop. It is executed depending on the state of the Motor Control
 * subsystem (see the state machine(s)).
 *
 * @retval Number of the motor instance which FOC loop was executed.
 */
uint8_t MC_HighFrequencyTask(void)
{

    uint8_t bMotorNbr = 0;
    uint32_t wFOCreturn;

    BemfObserverInputs_t BemfObsInputs;
    BemfObsInputs.Valfa_beta = FOCVars[M1].Valphabeta;

    HallPosSensor_CalcElAngle(&HallPosSensorM1);
    RotorPosObs_CalcElAngle(&RotorPosObsM1, 0);
    
