tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/application_motor/mc_tasks.c
#if AUTOTUNE_ENABLE
    Autotune_CalcPhaseCurrents(pPWMCurrFdbk[M1]);
    Driver_Enable(&MCInterface->bDriverEn);
    MotorState_t StateM1;
    StateM1 = MCStateMachine_GetState(&MCStateMachine[M1]);
    if (StateM1 == M_AUTOTUNE_IDENTIFICATION || StateM1 == M_AUTOTUNE_ENTER_IDENTIFICATION || StateM1 == M_AUTOTUNE_ANY_STOP_IDENTIFICATION)
    {
        R_AID_CurrentCtrlISR();
    }
#else
    // Check if the Hall Sensors are disconneted and raise the error
    if (HallSensor_IsDisconnected(&HallPosSensorM1) == true)
    {
        MCStateMachine_WarningHandling(&MCStateMachine[M1], MC_HALL_DISC, 0);
    }
    else
    {
        MCStateMachine_WarningHandling(&MCStateMachine[M1], 0, MC_HALL_DISC);
    }
    
    /* here the code is checking last 16 records of direction, 
    if all last 16 records show vibration, then rasie the stuck protection error */
    if ((HallPosSensorM1.wDirectionChangePattern & 0xFFFF) == VIBRATION_PATTERN)
    {
        MCStateMachine_FaultProcessing(&MCStateMachine[M1], MC_MSRP, 0);    //Report the Fault and change bstate to FaultNow
    }
    
    wFOCreturn = FOC_CurrControllerM1();
    if (wFOCreturn == MC_FOC_DURATION)
    {
        MCStateMachine_FaultProcessing(&MCStateMachine[M1], MC_FOC_DURATION, 0);
    }
    else
    {
        //        BemfObsInputs.Ialfa_beta = FOCVars[M1].Ialphabeta;
        //        BemfObsInputs.Vbus = VbusSensor_GetAvBusVoltageDigital(&(pBusSensorM1->Super));
        //        BemfObsPll_CalcElAngle (&BemfObserverPllM1, &BemfObsInputs);
        //        BemfObsPll_CalcAvrgElSpeedDpp (&BemfObserverPllM1);
    } 

    #if LOGMOTORVALS
    LogHS_LogMotorVals(&LogHS_handle); //High speed logging, if disable function does a run through
    #endif
    #if LOGMOTORVALSRES
    LogHS_LogMotorValsVarRes(&LogHS_handle); //High speed logging, if disable function does a run through
    #endif
#endif
    
    return bMotorNbr;
}

/**
 * @brief It executes the core of FOC drive that is the controllers for Iqd
 *        currents regulation. Reference frame transformations are carried out
 *        accordingly to the active speed sensor. It must be called periodically
 *        when new motor currents have been converted
 * @param this related object of class CFOC.
 * @retval int16_t It returns MC_NO_FAULTS if the FOC has been ended before
 *                 next PWM Update event, MC_FOC_DURATION otherwise
 */
inline uint32_t FOC_CurrControllerM1(void)
{
    qd_t Iqd = {0}, Vqd = {0};
    ab_t Iab = {0};
    AlphaBeta_t Ialphabeta = {0}, Valphabeta = {0};

    int16_t hElAngle;
    uint32_t wCodeError = 0;
    SpdPosFdbkHandle_t *speedHandle;

    speedHandle = SpdTorqCtrl_GetSpeedSensor(pSpeedTorqCtrl[M1]);
    hElAngle = SpdPosFdbk_GetElAngle(speedHandle);

#if (BYPASS_POSITION_SENSOR)
    hOpenloopTheta += hOpenloopSpeed;
    hElAngle = hOpenloopTheta;
#endif

    PWMCurrFdbk_GetPhaseCurrents(pPWMCurrFdbk[M1], &Iab);
    MotorState_t StateM1;
    StateM1 = MCStateMachine_GetState(&MCStateMachine[M1]);
    
    if (StateM1 == M_RUN || StateM1 == M_ANY_STOP)
    {
        Ialphabeta = MCMath_Clarke(Iab);
        Iqd = MCMath_Park(Ialphabeta, hElAngle);

        Vqd.q = PI_Controller(pPIDIq[M1],
                              (int32_t)(FOCVars[M1].Iqdref.q) - Iqd.q);

        Vqd.d = PI_Controller(pPIDId[M1],
                              (int32_t)(FOCVars[M1].Iqdref.d) - Iqd.d);

        Vqd = Feedforward_VqdConditioning(pFeedforward[M1], Vqd);

#if (BYPASS_CURRENT_CONTROL)
        Vqd.q = 2000;
        Vqd.d = 0;
#endif

        Vqd = CircleLimitation(pCircleLimitation[M1], Vqd);
        Valphabeta = MCMath_RevPark(Vqd, hElAngle);
        
        if ((MCInterface->Iqdref.q == 0) && (MCInterface->Iqdref.d == 0) && (MCInterface->hFinalTorque == 0) && (MCInterface->bDriverEn == true))
        {
            if (hDriverCounter >= DRIVER_TIMER)
            {
                hDriverCounter = 0;
                Driver_Disable(&MCInterface->bDriverEn);
            }
            else
            {
                hDriverCounter++;
            }
        }
        else if ((MCInterface->bDriverEn == false) && (MCInterface->hFinalTorque != 0))
        {
            Driver_Enable(&MCInterface->bDriverEn);
        }
        
        wCodeError = PWMCurrFdbk_SetPhaseVoltage(pPWMCurrFdbk[M1], Valphabeta);

        FOCVars[M1].Vqd = Vqd;
        FOCVars[M1].Iab = Iab;
        FOCVars[M1].Ialphabeta = Ialphabeta;
        FOCVars[M1].Iqd = Iqd;
        FOCVars[M1].Valphabeta = Valphabeta;
        FOCVars[M1].hElAngle = hElAngle;
        MC_DataProcess(pFieldWeakening[M1], Vqd);
        Feedforward_DataProcess(pFeedforward[M1]);

        // Check for overcurrent condition (software overcurrent protection)
        if (PWMCurrFdbk_CheckSoftwareOverCurrent(pPWMCurrFdbk[M1], &Iab, &FOCVars[M1].Iqdref))
        {
            PWMCurrFdbk_SwitchOffPWM(pPWMCurrFdbk[M1]);
            MCStateMachine_FaultProcessing(&MCStateMachine[M1], MC_OCSP, 0);
        }

#if ENABLE_MC_DAC_DEBUGGING
        R_DAC_Write((DEBUG1_DAC_HANDLE_ADDRESS)->p_ctrl, (uint16_t)FOCVars[M1].Iqd.q + INT16_MAX);
        R_DAC_Write((DEBUG2_DAC_HANDLE_ADDRESS)->p_ctrl, (uint16_t)FOCVars[M1].Iqd.d + INT16_MAX);
#endif
    }

    return (wCodeError);
}

/**
 * @brief  Executes safety checks (e.g. bus voltage and temperature) for all drive instances.
 *
 * Faults flags are updated here.
 */
void MC_SafetyTask(void)
{
    if (bMCBootCompleted == 1)
    {
        SafetyTask_PWMOFF(M1);
    }
}

/**
 * @brief  Safety task implementation if    MC.ON_OVER_VOLTAGE == TURN_OFF_PWM
 * @param  bMotor Motor reference number defined
 *         \link Motors_reference_number here \endlink
 * @retval None
 */
void SafetyTask_PWMOFF(uint8_t bMotor)
{
    uint32_t CodeReturn = MC_NO_ERROR;
    uint32_t errMask[NBR_OF_MOTORS] = {VBUS_TEMP_ERR_MASK};

    // Check if Controller temperature is higher than the threshold, then raise the error
    if (NTCTempSensor_CalcAvTemp(pTemperatureSensorController[bMotor]) == NTC_OT)
    {
        CodeReturn |= errMask[bMotor] & MC_OVER_TEMP_CONTROLLER;
    }

    // Check if Motor temperature is higher than the threshold, then raise the error
    if (NTCTempSensor_CalcAvTemp(pTemperatureSensorMotor[bMotor]) == NTC_OT)
    {
        CodeReturn |= errMask[bMotor] & MC_OVER_TEMP_MOTOR;
    }
    
