tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/application_motor/mc_tasks.c
    if (NTCTempSensor_CalcAvTemp(pTemperatureSensorController[bMotor]) == NTC_FREEZE)
    {
        CodeReturn |= errMask[bMotor] & MC_NTC_FREEZE_CONTROLLER;
    }
    
    CodeReturn |= PWMCurrFdbk_CheckOverCurrent(pPWMCurrFdbk[bMotor]);               /* check for fault. It return MC_OCD1, MC_OCD2 or MC_NO_FAULTS
                                                                                    (for STM32F30x can return MC_OVER_VOLT in case of HW Overvoltage) */
    if (((CodeReturn & MC_OCD2) == MC_OCD2) && (bOCCheck < OCD2_MAX))
    {
        bOCCheck++;
        
        if (bOCCheck == OCD2_MAX)
        {
            CodeReturn |= errMask[bMotor] & MC_OCD1;
        }
    }
    
    if (bMotor == M1)
    {
        CodeReturn |= errMask[bMotor] & ResDivVbusSensor_CalcAvVbus(pBusSensorM1);
    }
    
    MCStateMachine_FaultProcessing(&MCStateMachine[bMotor], CodeReturn, ~CodeReturn); /* Update the MCStateMachine according error code */
    switch (MCStateMachine_GetState(&MCStateMachine[bMotor]))                         /* Acts on PWM outputs in case of faults */
    {
    case M_FAULT_NOW:
        PWMCurrFdbk_SwitchOffPWM(pPWMCurrFdbk[bMotor]);
        FOC_Clear(bMotor);
        MotorPowMeas_Clear((MotorPowerMeasHandle_t *)pMotorPower[bMotor]);
        break;
    case M_FAULT_OVER:
        PWMCurrFdbk_SwitchOffPWM(pPWMCurrFdbk[bMotor]);
        break;
    default:
        break;
    }
}

/**
  * @brief  Turns off the PWM for M1
    * @param    None
    * @retval None
  */
void MC_PWM_OFF_M1()
{
    PWMCurrFdbk_SwitchOffPWM(pPWMCurrFdbk[M1]);
}

/**
 * @brief  This function returns the reference of the MCInterface relative to
 *         the selected drive.
 * @param  bMotor Motor reference number defined
 *         \link Motors_reference_number here \endlink
 * @retval MotorControlInterfaceHandle_t * Reference to MCInterface relative to the selected drive.
 *         Note: it can be MC_NULL if MCInterface of selected drive is not
 *         allocated.
 */
MotorControlInterfaceHandle_t *GetMCI(uint8_t bMotor)
{
    MotorControlInterfaceHandle_t *retVal = MC_NULL;
    if (bMotor < NBR_OF_MOTORS)
    {
        retVal = oMCInterface[bMotor];
    }
    return retVal;
}

/**
 * @brief  This function returns the reference of the MCTuning relative to
 *         the selected drive.
 * @param  bMotor Motor reference number defined
 *         \link Motors_reference_number here \endlink
 * @retval MotorControlTuningHandle_t motor control tuning handler for the selected drive.
 *         Note: it can be MC_NULL if MCInterface of selected drive is not
 *         allocated.
 */
MotorControlTuningHandle_t *GetMCT(uint8_t bMotor)
{
    MotorControlTuningHandle_t *retVal = MC_NULL;
    if (bMotor < NBR_OF_MOTORS)
    {
        retVal = &MCTuning[bMotor];
    }
    return retVal;
}

void MC_HardwareFaultTask(void)
{
    PWMInsulCurrSensorFdbk_SwitchOffPWM(pPWMCurrFdbk[M1]);
    MCStateMachine_FaultProcessing(&MCStateMachine[M1], MC_SW_ERROR, 0);
}

/* startMCMediumFrequencyTask function */
__NO_RETURN void startMCMediumFrequencyTask(void *pvParameter)
{
    UNUSED_PARAMETER(pvParameter);

    /* Infinite loop */
    for (;;)
    {
        /* delay of 500us */
        osDelay(1);

        MC_RunMotorControlTasks();
    }
}

/* startMCSafetyTask function */
__NO_RETURN void startMCSafetyTask(void *pvParameter)
{
    UNUSED_PARAMETER(pvParameter);

    /* Infinite loop */
    for (;;)
    {
        /* delay of 500us */
        osDelay(1);

        MC_SafetyTask();
    }
}


/**
 * @brief  Calculate the moving average value of last CURRENT_AVG_WIN_SIZE current samples
 * @param  pHandle pointer on the handle structure of the PWMC instance
 * @retval None
**/
void PWMCurrFdbk_IqdMovingAverage(FOCVars_t * pHandle)
{
    static uint8_t AvgIndex = 0;
    static qd_t Iqd_Samples[CURRENT_AVG_WIN_SIZE];    
    int32_t sumIq = 0, sumId = 0; 
    
    // write latest CURRENT value on the last updated value in array
    Iqd_Samples[AvgIndex]= pHandle->Iqd;
    
    // update AvgIndex to the next last updated value
    if (AvgIndex >= (CURRENT_AVG_WIN_SIZE - 1))
    {
        AvgIndex = 0;
    }
    else
    {
        AvgIndex++;
    }
    
    // calculate the average
    for (uint8_t i = 0; i < CURRENT_AVG_WIN_SIZE; i++ )
    {
        sumIq += Iqd_Samples[i].q;
        sumId += Iqd_Samples[i].d;
    }
    pHandle->Iqd_avg.q = (int16_t)(sumIq / CURRENT_AVG_WIN_SIZE);   
    pHandle->Iqd_avg.d = (int16_t)(sumId / CURRENT_AVG_WIN_SIZE);
}

/**
 * @brief  Checks if the value of IQ measured is smaller than one PHASE_WIRE_DISCONNECT_RATIO of Iqref
 * @param  pHandle pointer on the handle structure of the FOCVars
 * @retval bool: true if diconnection detected,
**/

bool IsPhaseCableDisconnected(FOCVars_t * pHandle, int16_t MechSpeed)
{
    static uint16_t Timer_Disc, Timer_Conn;

    bool retVal = false;
    PWMCurrFdbk_IqdMovingAverage(pHandle);
    uint16_t MeanSquare = (uint16_t)sqrt((pHandle->Iqd_avg.q * pHandle->Iqd_avg.q) + (pHandle->Iqd_avg.d * pHandle->Iqd_avg.d));
    
    if ((MeanSquare < (abs(pHandle->Iqdref.q))) && (abs(MechSpeed) == 0))
    {
        Timer_Disc++;
        Timer_Conn = 0;
    }
    else
    {
        Timer_Disc = 0;
        Timer_Conn++;
    }
    
    if (Timer_Disc > PHASE_WIRE_DISCONNECT_WAIT_MCCYCLE)
    {
        retVal = true;
        Timer_Conn = 0;
    }
    else if (Timer_Conn > PHASE_WIRE_DISCONNECT_WAIT_MCCYCLE)
    {
        Timer_Disc = 0;
        retVal = false;
    }
    return retVal;
}

#if AUTOTUNE_ENABLE
/*************************** TUNING ************************************/
/**
  * @brief  This function fills the initiate values to the tuning variables
  */
void MCTask_InitTuning()
{
    pAutoTune.MotorTunerInput.NumPolePairs = 8;
    pAutoTune.MotorTunerInput.RatedMotorCurrent = 30;
    pAutoTune.MotorTunerInput.DCBusVoltage = 48;
}

/**
  * @brief  This function returns the results of the last identification procedure.
  * @param  fBatteryVoltage Rated DC voltage of battery used to operate the motor.
  * @retval True if last identification was successfully completed.
  */
bool MC_UpdateMotorTunerOutput(float fBatteryVoltage)
{
    bool bRetVal = false;
    st_aid_id_setting_t IdentificationSettings;
    
    pAutoTune.MotorTunerOutput.fProgress = R_AID_GetProgress();
    pAutoTune.MotorTunerOutput.hErrorCode = R_AID_GetErrorStatus();
    pAutoTune.MotorTunerOutput.bCompleted = false;
    
